# ===================== 停用词 =====================
STOPWORDS = {
    '估计', '留下', '念头', '没有', '时间', '观念', '评分', '预订', '结果',
    '预计', '差点', '挺大', '吃惊', '案头', '被单',
    '个', '是', '要', '去', '住', '能', '还有', '作为', '说', '搞', '行',
    '吃', '被', '头', '来', '弄', '的', '了', '在', '有', '会', '到',
    '让','回', '做', '叫', '定', '没', '同', '时', '知道',
     '起', '人', '块', '携程', '工号', '客服', '点评'
}

# ===================== 负面情感词 =====================
NEGATIVE_WORDS = {
    "难", "低", "远", "很小", "嘈杂", "偏", "费劲", "紧张", "郁闷", "不爽",
    "差", "难吃", "慢", "简陋", "偏贵", "遗憾", "不足", "旧", "脏", "贵",
    "冷", "小", "短", "少", "坏", "硬", "臭", "吵", "乱", "烂",
    "热", "冷淡", "很贵","很差"
}

# ===================== 正面情感词 =====================
POSITIVE_WORDS = {
    "好", "不错", "最好", "很好", "方便", "便捷", "便利", "快", "快捷", "干净", "清洁", "整洁",
    "舒服", "宽敞", "有效", "便宜", "豪华", "高", "很高", "近", "新", "全", "幸好", "愉快",
    "正好", "清楚", "厉害", "耐心", "繁华"
}

# ===================== 错词修正 =====================
WORD_CORRECTION = {
    '批': '一批',
    '预': '预订',
    '数度': '进度'
}

# ===================== 保留词性 =====================
USEFUL_POS = {'n', 'v', 'a', 'ad', 'ns', 'vn'}